
* GP2Y0A21YK0F  10-80


| x, 1/cm |   x, px | y, V |   y, px |
|---------+---------+------+---------|
|     0.2 | 338.489 |  3.5 | 265.416 |

ADC (ATmega):
5.0V -> 1023

| 1 l, cm | 2 x white, pix | 3 y white, pix | 4 x gray, pix | 5 y gray, pix |    6=1 x white, 1/cm |       7 y white, V | 8 y white, ADC (atmega) |     9=1 x gray, 1/cm |       10 y gray, V | 11 y gray, ADC (atmega) |
|---------+----------------+----------------+---------------+---------------+----------------------+--------------------+-------------------------+----------------------+--------------------+-------------------------|
|      80 |         21.338 |         30.017 |        21.338 |        30.017 | 0.012607795231159657 | 0.3958295656629593 |                      81 | 0.012607795231159657 | 0.3958295656629593 |                      81 |
|      50 |         34.075 |         45.616 |        34.075 |        45.616 | 0.020133593706147028 | 0.6015311812400157 |                     123 | 0.020133593706147028 | 0.6015311812400157 |                     123 |
|      40 |         43.016 |         55.615 |        43.016 |        55.615 |  0.02541648325351784 | 0.7333864574856075 |                     150 |  0.02541648325351784 | 0.7333864574856075 |                     150 |
|      30 |         56.824 |         69.860 |        56.824 |        69.860 |  0.03357509402078059 | 0.9212330831600205 |                     188 |  0.03357509402078059 | 0.9212330831600205 |                     188 |
|      25 |         67.870 |         81.897 |        67.870 |        81.897 |  0.04010174629013056 | 1.0799631521837418 |                     221 |  0.04010174629013056 | 1.0799631521837418 |                     221 |
|      20 |         85.417 |         99.791 |        85.417 |        99.791 |  0.05046958689942658 | 1.3159285800403895 |                     269 |  0.05046958689942658 | 1.3159285800403895 |                     269 |
|      15 |        112.364 |        124.464 |       112.364 |       124.464 |  0.06639152232421143 |  1.641287639027037 |                     336 |  0.06639152232421143 |  1.641287639027037 |                     336 |
|      10 |        169.945 |        176.499 |       169.945 |       176.499 |  0.10041389823598404 | 2.3274651867257434 |                     476 |  0.10041389823598404 | 2.3274651867257434 |                     476 |
|       8 |        210.499 |        207.826 |       210.499 |       207.826 |  0.12437568133676428 | 2.7405695210537417 |                     561 |  0.12437568133676428 | 2.7405695210537417 |                     561 |
|       7 |        240.462 |        225.804 |       240.462 |       225.804 |  0.14207965399171021 | 2.9776426440003614 |                     609 |  0.14207965399171021 | 2.9776426440003614 |                     609 |
|       6 |        280.917 |        238.298 |       280.538 |       236.984 |  0.16598294183858264 | 3.1423991017873827 |                     643 |  0.16575900546251138 | 3.1250715857371074 |                     639 |
|       5 |        337.423 |        233.557 |       337.423 |       234.700 |  0.19937014201347755 | 3.0798802634355122 |                     630 |  0.19937014201347755 | 3.0949528287669166 |                     633 |
#+TBLFM: $6='(/ (* 0.2 $2) 338.489);N :: $7='(/ (* 3.5 $3) 265.416);N :: $8='(round (/ (* (/ (* 3.5 $3) 265.416) 1023) 5.0));N :: $9='(/ (* 0.2 $4) 338.489);N :: $10='(/ (* 3.5 $5) 265.416);N :: $11='(round (/ (* (/ (* 3.5 $5) 265.416) 1023) 5.0));N
for update: C-u C-c C-c

coeff for white, ADC:
1/r = -0.014808851127408484 + 0.0002582568661552935*x
1/r = 0.004204305570443264  + 0.00011202833661179287*x + 1.986342663753638e-7*x*x
1/r = -0.011288270859270887 + 0.00030644722378675736*x  -4.503184201458347e-7*x*x     + 6.107313811353365e-10*x*x*x
1/r = 0.011428869737816816   -0.00009103255938432977*x + 0.0000017050364804206691*x*x  -3.844126649774024e-9*x*x*x + 3.0899429195502907e-12*x*x*x*x

coeff for white, V:
1/r = -0.014843662344124611 + 0.05285091481563967*x
1/r = 0.004183809107519133  + 0.022921741439770427*x + 0.008317192894092608*x*x
1/r = -0.01122163558016686  + 0.06247787681001393*x   -0.01870033690182772*x*x + 0.005202663880374169*x*x*x
1/r = 0.011579279883842913   -0.019161807892377036*x + 0.07187911805077674*x*x  -0.03310155603608381*x*x*x + 0.005435728694201699*x*x*x*x





* GP2Y0A02YK 20-150


| x, 1/cm |   x, px | y, V |   y, px |
|---------+---------+------+---------|
|     0.1 | 317.340 |  3.0 | 228.380 |



ADC (ATmega):
5.0V -> 1023


| 1 l, cm | 2 x white, pix | 3 y white, pix | 4 x gray, pix | 5 y gray, pix |    6=1 x white, 1/cm |        7 y white, V | 8 y white, ADC (atmega) |     9=1 x gray, 1/cm |        10 y gray, V | 11 y gray, ADC (atmega) |
|---------+----------------+----------------+---------------+---------------+----------------------+---------------------+-------------------------+----------------------+---------------------+-------------------------|
|     150 |         21.341 |         33.410 |        21.341 |        33.410 | 0.006724963761265521 | 0.43887380681320604 |                      90 | 0.006724963761265521 | 0.43887380681320604 |                      90 |
|     140 |         23.156 |         36.156 |        23.156 |        36.156 | 0.007296905527194807 |  0.4749452666608284 |                      97 | 0.007296905527194807 |  0.4749452666608284 |                      97 |
|     130 |         24.973 |         37.986 |        24.973 |        37.986 | 0.007869477531984623 |  0.4989841492249759 |                     102 | 0.007869477531984623 |  0.4989841492249759 |                     102 |
|     120 |         26.789 |         41.648 |        26.789 |        41.648 | 0.008441734417344176 |  0.5470881863560733 |                     112 | 0.008441734417344176 |  0.5470881863560733 |                     112 |
|     110 |         29.512 |         45.309 |        29.512 |        45.309 | 0.009299804625953237 |  0.5951790874857693 |                     122 | 0.009299804625953237 |  0.5951790874857693 |                     122 |
|     100 |         32.236 |         49.886 |        32.236 |        49.886 | 0.010158189953992564 |  0.6553025658989404 |                     134 | 0.010158189953992564 |  0.6553025658989404 |                     134 |
|      90 |         35.868 |         55.379 |        35.868 |        55.379 | 0.011302703724711666 |  0.7274586215955863 |                     149 | 0.011302703724711666 |  0.7274586215955863 |                     149 |
|      80 |         40.407 |         62.701 |        40.407 |        62.701 | 0.012733030818680281 |  0.8236404238549786 |                     169 | 0.012733030818680281 |  0.8236404238549786 |                     169 |
|      70 |         45.856 |         69.109 |        45.856 |        69.109 |   0.0144501165941892 |  0.9078159208336982 |                     186 |   0.0144501165941892 |  0.9078159208336982 |                     186 |
|      60 |         53.119 |         80.093 |        53.119 |        80.093 |  0.01673882901619714 |  1.0521017602241878 |                     215 |  0.01673882901619714 |  1.0521017602241878 |                     215 |
|      50 |         64.015 |         94.739 |        64.015 |        94.739 |  0.02017237032835445 |  1.2444916367457746 |                     255 |  0.02017237032835445 |  1.2444916367457746 |                     255 |
|      40 |         79.451 |        116.707 |        79.451 |       116.707 | 0.025036553853910633 |  1.5330633155267537 |                     314 | 0.025036553853910633 |  1.5330633155267537 |                     314 |
|      30 |        105.782 |        151.490 |       105.782 |       151.490 |  0.03333396357219386 |   1.989972852263771 |                     407 |  0.03333396357219386 |   1.989972852263771 |                     407 |
|      20 |        159.352 |        192.682 |       159.352 |       192.682 |  0.05021491145144011 |   2.531071021980909 |                     518 |  0.05021491145144011 |   2.531071021980909 |                     518 |
|      15 |        212.015 |        210.074 |       212.015 |       210.074 |  0.06681004600743683 |   2.759532358350118 |                     565 |  0.06681004600743683 |   2.759532358350118 |                     565 |
|      10 |        317.340 |        177.121 |       317.340 |       177.121 |                  0.1 |  2.3266617041772486 |                     476 |                  0.1 |  2.3266617041772486 |                     476 |
#+TBLFM: $6='(/ (* 0.1 $2) 317.340);N :: $7='(/ (* 3.0 $3) 228.380);N :: $8='(round (/ (* (/ (* 3.0 $3) 228.380) 1023) 5.0));N :: $9='(/ (* 0.1 $4) 317.340);N :: $10='(/ (* 3.0 $5) 228.380);N :: $11='(round (/ (* (/ (* 3.0 $5) 228.380) 1023) 5.0));N
for update: C-u C-c C-c



coeff for white, ADC:
1/r = -0.005368422729085574 + 0.00011094903700760776*x
1/r = 0.005747211905175338  + 0.000009749210879995599*x + 1.6126151778189524e-7*x*x
1/r = -0.007613288708451495 + 0.0001943266908042049*x    -5.326350615941393e-7*x*x    + 7.379341852132346e-10*x*x*x
1/r = 0.009136880597455758   -0.00011375101991517708*x  + 0.0000013080880081279523*x*x -3.563346518526791e-9*x*x*x + 3.4025145623983315e-12*x*x*x*x

coeff for white, V:
1/r = -0.005361810673298221 + 0.022706891446954258*x
1/r = 0.005752544699240504  + 0.0019915176505690482*x + 0.0067569878432058*x*x
1/r = -0.007713247557969476 + 0.040073255158952534*x   -0.022552639126637956*x*x + 0.006381498043099675*x*x*x
1/r = 0.00919377592980753    -0.023572868079315717*x  + 0.055286683474987205*x*x  -0.03085149359279616*x*x*x + 0.006029346489840771*x*x*x*x


* GP2Y0A710K 100-550


| x, 1/cm |   x, px | y, V |   y, px |
|---------+---------+------+---------|
|    0.01 | 342.962 | 3.5  | 268.125 |



ADC (ATmega):
5.0V -> 1023

|            1 l, cm | 2 x white, pix | 3 y white, pix | 4 x gray, pix | 5 y gray, pix |     6=1 x white, 1/cm |       7 y white, V | 8 y white, ADC (atmega) | 9=1 x gray, 1/cm | 10 y gray, V | 11 y gray, ADC (atmega) |
|--------------------+----------------+----------------+---------------+---------------+-----------------------+--------------------+-------------------------+------------------+--------------+-------------------------|
|  545.7875807632323 |         62.838 |        105.000 |               |               |  0.001832214647686916 | 1.3706293706293706 |                     280 |              0.0 |          0.0 |                       0 |
|  500.9450360048494 |         68.463 |        106.875 |               |               | 0.0019962269872464003 | 1.3951048951048952 |                     285 |              0.0 |          0.0 |                       0 |
| 451.48559166962866 |         75.963 |        107.850 |               |               | 0.0022149101066590467 | 1.4078321678321677 |                     288 |              0.0 |          0.0 |                       0 |
|  397.6924325703286 |         86.238 |        110.625 |               |               | 0.0025145059802543722 |  1.444055944055944 |                     295 |              0.0 |          0.0 |                       0 |
|  348.3156109401501 |         98.463 |        114.375 |               |               | 0.0028709594648969857 |  1.493006993006993 |                     305 |              0.0 |          0.0 |                       0 |
| 299.88895009749655 |        114.363 |        119.100 |               |               |  0.003334567678051796 | 1.5546853146853146 |                     318 |              0.0 |          0.0 |                       0 |
| 250.58781409146368 |        136.863 |        127.500 |               |               |  0.003990617036289735 | 1.6643356643356644 |                     341 |              0.0 |          0.0 |                       0 |
| 199.96268504428232 |        171.513 |        138.750 |               |               |  0.005000933047976161 | 1.8111888111888113 |                     371 |              0.0 |          0.0 |                       0 |
|  149.9857869441055 |        228.663 |        157.500 |               |               |  0.006667298417900526 |  2.055944055944056 |                     421 |              0.0 |          0.0 |                       0 |
|              100.0 |        342.962 |        190.350 |               |               |                  0.01 |  2.484755244755245 |                     508 |              0.0 |          0.0 |                       0 |
#+TBLFM: $1='(/ 1.0 (/ (* 0.01 $2) 342.962));N :: $6='(/ (* 0.01 $2) 342.962);N :: $7='(/ (* 3.5 $3) 268.125);N :: $8='(round (/ (* (/ (* 3.5 $3) 268.125) 1023) 5.0));N :: $9='(/ (* 0.01 $4) 342.962);N :: $10='(/ (* 3.5 $5) 268.125);N :: $11='(round (/ (* (/ (* 3.5 $5) 268.125) 1023) 5.0));N
for update: C-u C-c C-c



coeff for white, ADC:
1/r = -0.007905513992440287 + 0.00003501681514987246*x
1/r = -0.006480940392078231 + 0.000027293184129290324*x + 9.981527192433176e-9*x*x
1/r = -0.023045921431388956 + 0.00016114042240361316*x   -3.419897731121909e-7*x*x    + 3.0090064345924763e-10*x*x*x
1/r = -0.10187243921321469  + 0.0010199350940547584*x    -0.000003799162850464599*x*x + 6.391737720657689e-9*x*x*x -3.96057389025945e-12*x*x*x*x


coeff for white, V:
1/r = -0.007927569267231583 + 0.007175472832752056*x
1/r = -0.006828630643452634 + 0.005957899410752004*x + 0.0003215493051309764*x*x
1/r = -0.023232558563341485 + 0.033055692463770506*x  -0.014247170227475176*x*x + 0.00254639590659309*x*x*x
1/r = -0.09621760230798444  + 0.1956678351601397*x    -0.14812264922052748*x*x  + 0.050783383512638995*x*x*x -0.006414800473492256*x*x*x*x







